for 循环语句

for anElement in object:
    #缩进语句块 循环体

    依次遍历对象 (object)中的每个元素，并赋值给anElenment，
然后执行循环体内语句


---------------------------------------
计算 1+2+3+...+10 的值
s = 0
for i in range(11):
    s +=i

print   'sum is :',s


range 函数生成0，1，。。。，10 的序列

------------------------------------
s = 0
i = 1

while i <= 10:
    s += i
    i += 1

print 'sum is ',s
-----------------------------------------
range   函数

range (star,stop[,step])
       起始，终止 ，步长

生成一系列整数
等差数列。。。。

例子
range(2,10)  [2,3,4,5,6,7,8,9]
range(2,10)  [2,5,8]
range(10,2,-1) [10,9,8,7,6,5,4,3]
---------------------------------------
求常数e
       1   1    1    1    1    1          1
e=1 + —— + —— + —— + —— + —— + —— + ... + ——
       1！  2！  3！  4！  5！   6！        i！

求一个数的阶乘
import math

for i in (1,10):
    e += 1./math.factorial(i)  #math.factorial(i) 求阶乘
#1.是因为浮点数精度高，否则整数/整数还是整数 orz

print e


---------------------------------------------------------------
