多次求解一元二次方程
a=0,b=1,c=1
a=1,b=2,c=1
a=1,b=3,c=1
a=-1,b=1,c=1
a=-1,b=-1,c=1

程序可以多次计算(输入字符'q')退出程序，输入其他字符则继续执行


while 循环结构
#-------------------------------
while 循环条件:
    缩进语句块(循环体)
其余语句
#--------------------------------
while 循环结构的分析策略
1循环体外设定循环可执行的初始条件
2书写需要重复执行的代码(循环体)
3设定循环条件并在循环体内设定条件改变语句

没有这三个，就陷入死循环

例子：
count = 0

while count<5:
    print 'programming is fun!'
    count +=1


循环示例 1+2+3+。。。+10
s = 0
i = 1

while i<=10:
    s += i
    i += 1
print s



循环结构测验
    下列求100以内所有奇数之和的程序是否正确？
sum = 0
i = 1  #这是基数 比较时候要用它比100比大小
while i < 100:
    if i % 2 != 0:
        sum += i
    i += 2
print sum

下列求100以内所有偶数之和的程序是否正确？
sum = 0
i = 0
while i < 100:
    if i % 2 == 0:
        sum += i
        i += 2
print sum
