

函数-结构化程序设计方法


            问题
             |
     ————————————————
     |              |
  子问题1         子问题2
                    |
                ——————————
                |        |
            孙子问题1   孙子问题2
                        |
                ————————————
                |           |
            重孙问题1       重孙问题2
                |
                |
                |
            ——————————
            |顺序    |
            |选择    |
            |循环     |
            |————————
自顶向下法

自底向上法
